def menu1():
	print("#"*80)
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*28+"Welcome to the program"+" "*28+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"*80)

def menu2():
	print("#"*80)
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*37+"Menu"+" "*37+"#")
	print("#"+" "*78+"#")
	print("#"+" "*24+"1.Gasoline 95   ราคา 29.16 BATH"+" "*23+"#")
	print("#"+" "*24+"2.Gasoline 91   ราคา 25.30 BATH"+" "*23+"#")
	print("#"+" "*24+"3.Gassohol 91   ราคา 21.68 BATH"+" "*23+"#")
	print("#"+" "*24+"4.Gassohol E20  ราคา 20.2  BATH"+" "*23+"#")
	print("#"+" "*24+"5.Gassohol 95   ราคา 21.0  BATH"+" "*23+"#")
	print("#"+" "*24+"6.Diesel        ราคา 21.1  BATH"+" "*23+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"*80)

def menu3():
	print("#"*80)
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*33+"ชนิดการคำนวน"+" "*34+"#")
	print("#"+" "*78+"#")
	print("#"+" "*33+"1.ลิตรเป็นเงิน"+" "*34+"#")
	print("#"+" "*33+"2.เงินเป็นลิตร"+" "*34+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"*80)

def menu4():
	print("#"*80)
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*31+"กรุณาใส่ค่าการคำนวน"+" "*31+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"*80)


def menu5():
	print("#"*80)
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*30+"ออกจากโปรแกรมหรือไม่"+" "*30+"#")
	print("#"+" "*78+"#")
	print("#"+" "*31+"1. ออกจากโปรแกรม"+" "*31+"#")
	print("#"+" "*31+"2. เริ่มรันใหม่อีกครั้ง"+" "*31+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"+" "*78+"#")
	print("#"*80)

while True :

	menu1()
	b = input(">>>>กด Enter เพื่อทำรายการ<<<<")

	a = 0
	while not(a in [1,2,3,4,5,6]) :	
		menu2()
		b = input("เลือกเชื้อเพลิง :")
		if b.isnumeric() :
			a = int(b)
			m = a

		else:
			a = 0

	a = 0
	while not(a in [1,2]) :
		menu3()
		b = (input("เลือกชนิดการคำนวนข้อมูล :"))
		if b.isnumeric() :
			a = int(b)
			i = a
		else:
			a = 0
	

	menu4()
	i = 0
	while not (i in [1,2]) :
		j = i
	if 1 in j :
		c = input("กรุณาใส่จำนวนลิตร :")
		c1 = int(c)
	elif 2 in j :
		d = input("กรุณาใส่จำนวนเงิน :")
		d1 = int(d)
	e = 0
	if 2 in j :
		if 1 in m :
			e = e + (d1*29.16)
			print("จำนวนเงิน = " ,e)


		

	a = 0
	while not(a in [1,2]) :
		menu5()
		b = (input("เลือกออกจากโปรแกรม :"))
		if b.isnumeric() :
			a = int(b)
		else:
			a = 0
	if a == 1 :
		break






	
